Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-38-42.tmx
Source language: bo
Languages: en

source: དེའི་ཚེ་རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །རིགས་ཀྱི་བུ་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་སྐར་མའི་འོད་ཀྱི་བཙུན་མོ་པདྨོའི་འོད་ཅེས་བྱ་བ་རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པའི་ཡུམ་དུ་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་སེམས་ཅན་ཡང་དེ་ལྟར་མྱི་བལྟ་སྟེ།
en: At that time, in that time, who was Padmaprabhā, the queen of King Jyotiṣprabha and the mother of King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa?

source: ལྷ་མོ་སྒྱུ་མ་འདི་ནི་དེའི་ཚེ་རྒྱལ་པོ་བཙུན་མོ་པདྨོའི་འོད་ཅེས་བྱ་བར་གྱུར་ཏེ། རྫུས་ཏེ་བྱུང་བའི་གཞོན་ནུ་ཐུ་བར་ལེན་ལེན་པའོ།
en: Do not think that it was anyone else, for at that time, in that time, Māyādevī was Padmaprabhā, the king’s queen who took the miraculously born prince onto her lap.

source: །ཡང་རིགས་ཀྱི་བུ་ཁྱོད་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་སྐར་མའི་འོད་ཅེས་བྱ་བ་རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པའི་ཡབ་དུ་གྱུར་པ།
en: “Also, what do you think, noble one? At that time, in that time, who was Jyotiṣprabha , the father of King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa?

source: དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་སེམས་ནའང་། དེ་ལྟར་མྱི་བལྟ་སྟེ། རྒྱལ་པོ་ཟས་གཙང་མ་ནི་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་སྐར་མའི་འོད་ཅེས་བྱ་བར་གྱུར་ཏོ།
en: Do not think that it was anyone else, for at that time, in that time, Śuddhodana was the king named Jyotiṣprabha

source: །ཡང་རིགས་ཀྱི་བུ་ཁྱོད་དེའི་ཚེ་དེའི་དུས་ན་ཚོང་དཔོན་གྱི་བུ་མོ་རིན་ཆེན་འོད་ཅེས་བྱ་བ་བྱུང་བ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་སེམས་ནའང་དེ་ལྟར་མྱི་བལྟ་སྟེ།
en: “Also, what do you think, noble one? At that time, in that time, who was Ratnaprabhā, the head merchant’s daughter?

source: ཁོ་མོ་ནི་དེའི་ཚེ་དེའི་དུས་ན་ཚོང་དཔོན་གྱི་བུ་མོ་རིན་ཆེན་འོད་ཅེས་བྱ་བར་གྱུར་ཏོ།
en: Do not think that it was anyone else, for at that time, in that time, I was Ratnaprabhā, the head merchant’s daughter.

source: །ཡང་རིགས་ཀྱི་བུ་ཁྱོད་དེའི་ཚེ་དེའི་དུས་ན་སེམས་ཅན་འཛམ་བུའི་གླིང་དེར་སྐྱེས་ཤིང་རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པས་བསྡུ་བའི་དངོས་པོ་བཞིས་ཡོངས་སུ་བསྡུས་པ་དེ་དག་གཞན་དག་ཅིག་ཡིན་པ་སྙམ་དུ་སེམས་ན་དེ་ལྟར་མྱི་བལྟ་སྟེ།
en: “Also, what do you think, noble one? At that time, in that time, who were the beings who had been born in Jambudvīpa and whom King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa had gathered together through the four methods of gathering pupils?

source: བཅོམ་ལྡན་འདས་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་འདི་ཉིད་དུ་འདུས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མྱི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའི་ས་ལ་བཀོད་དེ།
en: Do not think that it was anyone else, for they are those who are gathered in this assembly of the followers of the Bhagavat, have been established on the bodhisattva path, and are progressing irreversibly toward the highest, complete enlightenment.

source: ལ་ལ་ནི་ས་དང་པོ་ལ་བཀོད། ལ་ལ་ནི་ས་གཉིས་པ། ལ་ལ་ནི་ས་གསུམ་པ། ལ་ལ་ནི་ས་བཞི་པ། ལ་ལ་ནི་ས་ལྔ་པ།
en: Some are established on the first bhūmi, some on the second bhūmi, some on the third bhūmi, some on the fourth bhūmi, some on the fifth bhūmi, some on the sixth bhūmi, some on the seventh bhūmi, some on the eighth bhūmi, some on the ninth bhūmi, and some are established on the tenth bodhisattva bhūmi.

source: ལ་ལ་ནི་ས་དྲུག་པ། ལ་ལ་ནི་ས་བདུན་པ། ལ་ལ་ནི་ས་བརྒྱད་པ། ལ་ལ་ནི་ས་དགུ་པ། ལ་ལ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ས་བཅུ་པ་ལ་བཀོད་པར་གྱུར་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་སྣ་ཚོགས་རྣམ་པ་ཐ་དད་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འཇུག་པ་སྣ་ཚོགས་དང་། ཚོགས་སྣ་ཚོགས་དང་། ཡང་དག་པར་བསྒྲུབ་པ་སྣ་ཚོགས་དང་། སྤྱོད་པ་སྣ་ཚོགས་དང་། འབྱུང་བ་སྣ་ཚོགས་དང་། ལམ་གྱི་རྒྱན་རྣམ་པར་དག་པ་སྣ་ཚོགས་དང་། རྣམ་པར་འཕྲུ་པ་དང་། ཁྱུ་མཆོག་གི་མཐུ་ཕྱུག་པ་སྣ་ཚོགས་དང་། ལམ་གྱི་རྒྱན་རྣམ་པར་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་བྱུང་སྟེ།
en: “They are bodhisattvas who have their attainments through various kinds of prayers, various ways of setting out toward omniscience, various accumulations, various accomplishments, various conducts, various setting forths, various pure displays of the path, various supremacies in miraculous manifestations, and different kinds of displays of the path.

source: རྣམ་པར་ཐར་པ་ལ་རྣམ་པར་སྤྱོད་པ་སྣ་ཚོགས་ཀྱིས་འཁོར་གྱི་དཀྱིལ་འཁོར་འདི་ན་ཆོས་ཀྱི་གཞལ་མེད་ཁང་སྣ་ཚོགས་ན་རྣམས་པར་སྤྱོད་པས་འཁོད་ཅིང་རྣམ་པར་སྤྱོད་པ་འདི་དག་ཡིན་ནོ།
en: “They are these practitioners who are dwelling and practicing within various divine palaces of the Dharma in this assembly of followers through their practice of various kinds of liberations.”

source: །དེ་ནས་མཚན་མོའི་ལྷ་མོ་ཤིང་ཐམས་ཅད་ཀྱི་མེ་ཏོག་རྒྱས་པས་བདེ་བར་གནས་པས་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་དགའ་བའི་འོད་སྤྲོ་བ་ཡངས་པ་ཡང་དག་པར་འབྱུང་བ་འདི་ཉིད་བརྣན་ཏེ་བསྟན་པའི་ཕྱིར་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: The night goddess Sarva­vṛkṣpraphullana­sukha­saṃvāsā, in order to teach further the bodhisattva liberation called the arising of the vast radiating light of joy , recited these verses to Sudhana, the head merchant’s son:

source: རྒྱལ་བའི་སྲས་པོ་ཁོ་མོའི་མྱིག་ཡངས་ཏེ།
en: “Son of the jinas, with my vast sight

source: །ཕྱོགས་ཀུན་ཞིང་མང་རྒྱ་མཚོ་སྣ་ཚོགས་ཀྱི།
en: I am looking into all directions At the vast ocean of realms of various kinds

source: །སེམས་ཅན་རྒྱ་ཆེན་གང་ཆེན་མཚོ་ཡི་རྣམས།
en: And also the ocean of beings in saṃsāra.

source: །འཁོར་བར་གྱུར་ཚེ་ཀུན་ལ་རྣམ་པར་བལྟ།
en: “I see the spotless jinas in the vast extent of all realms

source: །འབྱམ་ཀླས་ཞིང་རྣམས་ཀུན་ན་བཞུགས་པ་ཡི།
en: Present everywhere throughout the ten directions

source: །རྒྱལ་བ་བྱང་ཆུབ་ཤིང་གི་དྲུང་བཞུགས་པ། །རྡུལ་མེད་ཀུན་ཀྱང་ཕྱོགས་བཅུ་རྒྱས་བཀང་སྟེ།
en: Seated at the feet of Bodhi trees,

source: །ཆོས་སྒྲོག་རྟག་པར་འགྲོ་འདུལ་མཐོང་བར་བྱེད།
en: Teaching the Dharma and guiding beings.

source: །ཁོ་མོའི་རྣ་བ་རྒྱ་མཚོ་ཡོངས་སུ་དག །སྒྲ་རྣམས་མ་ལུས་ཐམས་ཅད་དེས་ཐོས་ཏེ།
en: “With the pure ocean of my hearing, I hear all sounds without exception.

source: །བདེ་བར་གཤེགས་པས་ཆོས་གསུངས་མ་ལུས་པར།
en: All the Dharma that is taught by the sugatas

source: །ཐམས་ཅད་དགའ་བས་ཡང་དང་ཡང་དུ་ཐོས།
en: I hear with delight again and again.

source: །ཁོ་མོའི་ཡེ་ཤེས་གཉིས་མེད་ཆགས་པ་མེད།
en: “My nondual, unimpeded knowledge

source: །སེམས་ཅན་གཞན་གྱི་སེམས་ཀྱི་ཡུལ་ལ་འཇུག །འགྲོ་བའི་སེམས་ཀྱི་རྒྱ་མཚོ་ཡངས་པ་རྣམས།
en: Enters the field of the minds of other beings. I comprehend the entirety of the characteristics Of the vast ocean of the minds of other beings.

source: །མ་ལུས་ཀུན་ལ་མཚན་ཉིད་དངོས་ཀྱིས་འཇུག །སྔོན་གྱི་མཐའ་དྲན་ཏིང་ངེ་འཛིན་སྟོབས་ཀྱིས།
en: “Through the power of memory and samādhi

source: །བསྐལ་པའི་རྒྱ་མཚོ་ཚད་མེད་ཁོ་མོས་ཤེས།
en: I know the ocean of countless kalpas in the past.

source: །ཚེ་རབས་རྒྱུད་མང་གང་ཆེན་མཚོ་དག་ཀྱང་།
en: And similarly I know the ocean of the successions

source: །ཕ་རོལ་དག་དང་བདག་ལའངདེ་བཞིན་ཤེས།
en: Of the many lifetimes of myself and of others. “I know in a single instant kalpas

source: །རྒྱ་མཚོའི་ཞིང་གཅིག་རྡུལ་ཕྲན་རབ་སྙེད་ཀྱི། །བསྐལ་པ་སྐད་ཅིག་ཅིག་གིས་མ་ལུས་ཤེས།
en: As numerous as the atoms in an ocean of realms,

source: །སེམས་ཅན་འགྲོ་རྒྱུད་དག་ན་འཁོར་བ་དང་། །སངས་རྒྱས་རྣམ་འཕྲུལ་ཚོགས་བཅས་དེ་བཞིན་ནོ།
en: The existences of beings within saṃsāra, And the buddhas and their hosts of miraculous manifestations. “I also remember the first aspirations Made by the knowers of the world,

source: །དེ་དག་ཐོག་མའི་སྨོན་ལམ་ཅི་འདྲ་དང་། །ཡང་དག་བསྒྲུབ་ཚུལ་འཇུག་ཚུལ་རྣམ་ཡངས་དང་། །སྤྱོད་ལ་བརྟེན་པས་ཚོགས་རྣམས་ཡངས་བསྒྲུབ་པ།
en: Their vast ways of attainment and engagement, And how through conduct they accomplished the accumulations. “In a single instant of mind I comprehend

source: །འཇིག་རྟེན་མཁྱེན་པ་རྣམས་ཀྱང་ཁོ་མོས་དྲན།
en: The vast ways of enlightenment and buddhahood Of all those who have reached the level of empowerment

source: །མཉམ་མེད་ཚད་མེད་ཚོགས་གྱུར་ཡོན་ཏན་མཚོ་མངའ་བའི། །དབང་བསྐུར་སར་བྱོན་ཇི་སྙེད་དེ་དག་དང་། །བྱང་ཆུབ་འཚང་རྒྱའི་ཚུལ་ནི་རྣམ་ཡངས་ལ།
en: Of having an ocean of unequaled, immeasurable qualities.

source: །སེམས་ཀྱི་སྐད་ཅིག་གཅིག་གིས་ཁོ་མོ་འཇུག །ཐབས་ཀྱི་རྣམ་པ་གང་དང་གང་དག་གིས།
en: “I know how the sugatas, through various methods,

source: །བདེ་གཤེགས་འཁོར་ལོ་དམ་པ་འགྲོར་བསྐོར་དང་། །མྱ་ངན་འདས་པ་ཡོན་ཏན་ཚད་མྱེད་དང་། ཆོས་རྣམ་གནས་པའི་དུས་ཀྱང་ཁོ་མོས་ཤེས།
en: Turn the supreme wheel for beings, The measureless qualities of their nirvāṇas, And the length of time their Dharma remains. “I comprehend individually, through various ways,

source: །དྲི་མེད་ཐེག་པ་རྒྱ་མཚོའི་ཚུལ་རྣམས་དང་། །སེམས་ཅན་རྣམ་འདུལ་རྣམ་ཡངས་ཇི་སྙེད་དང་། །འགྲོ་བ་དེ་དག་གིས་ནི་གང་བསྟན་པ། །སོ་སོ་ཀུན་ལ་སྣ་ཚོགས་ཚུལ་གྱིས་འཇུག །དགའ་བའི་གཏེར་དང་མོས་པའི་དབྱིག་གི་རྣམས།
en: The ocean of the ways of their stainless yānas, All their vast guidance for beings, And the teachings they give to beings.

source: །ཁོ་མོས་བསྐལ་པ་བརྒྱ་མང་རྒྱ་ཆེར་བསྒོམས།
en: “I have meditated for many hundreds of kalpas On the way of this liberation of the illumination Of the treasure of delight and the wealth of aspiration.

source: །དེ་ཚུལ་དེ་ལ་ཁྱོད་ཀྱང་མྱུར་འཇུག་གིས།
en: You too should quickly comprehend this way.

source: །རིགས་ཀྱི་བུ་ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ། དགའ་བའི་འོད་འཕྲོ་བ་ཡངས་པ་ཡང་དག་པར་འབྱུང་བ་འདི་ཤེས་པར་ཟད་ན།
en: “Noble one, I know only this bodhisattva liberation called the arising of the vast radiating light of joy

source: ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཞབས་ཀྱི་དྲུང་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་འཇུག་པའི་སྨོན་ལམ་རྒྱ་མཚོ་ལ་ཞུགས་པ།
en: How could I know the conduct or describe the qualities of bodhisattvas who at the feet of all the tathāgatas engage in an ocean of prayers to enter omniscience;

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་སྨོན་ལམ་རྒྱ་མཚོ་མངོན་པར་བསྒྲུབ་པའི་སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པ།
en: who complete the fulfillment of the ocean of the past prayers by the tathāgatas;

source: བྱང་ཆུབ་སེམས་དཔའི་ས་གཅིག་ནོན་པས་བྱང་ཆུབ་སེམས་དཔའི་ས་རྒྱ་མཚོ་ཐམས་ཅད་ཡོངས་སུ་གནོན་པའི་སྟབས་ལ་མཁས་པ།
en: who are skilled in reaching the ocean of all bodhisattva bhūmis through reaching one bodhisattva bhūmi;

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྒྱ་མཚོ་ཐམས་ཅད་སྤྱོད་པ་རེ་རེར་ཡང་དག་པར་འདུ་བའི་སྨོན་ལམ་དང་། སྤྱོད་པ་ཡོངས་སུ་དག་པ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་རེ་རེ་ལ།
en: who have pure prayer and conduct in which there is an ocean of all bodhisattva conducts included within each conduct;

source: བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་རྒྱ་མཚོ་ཐམས་ཅད་ཡོངས་སུ་འདུ་བར་རྣམ་པར་སྤྱད་པ་ལ་དབང་བསྒྱུར་བ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ། ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན།
en: who have the power of practice of the entire ocean of bodhisattva liberations being included within each bodhisattva liberation? “Depart, noble one.

source: །སོང་རིགས་ཀྱི་བུ་སྙིང་པོ་བྱང་ཆུབ་འདི་ཉིད་མཚན་མོའི་ལྷ་མོའི་འགྲོ་བ་ཐམས་ཅད་བསྲུང་བའི་སྨོན་ལམ་ལ་བརྩོན་པའི་འོད་ཅེས་བྱ་བ་ཞིག་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཕྱིན་ཅིང་འདུག་གིས། དེའི་གན་དུ་སོང་ལ།
en: The goddess of the night who has the name Sarva­jagad­rakṣā­praṇidhāna­vīrya­prabhā has come to this bodhimaṇḍa and is in the presence of the Bhagavat.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་ཅན་ཡོངས་སུ་སྦྱིན་པར་བྱ་བ་དང་། ཇི་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཡོངས་སུ་སྦྱང་བར་བྱ་བ་དང་། ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཤིན་ཏུ་མཉེས་པར་བྱ་བས་བསྙེན་བཀུར་ཞིང་རིམ་གྲོར་བྱ་བ་དང་། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ལ་བརྩོན་པར་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཚན་མོའི་ལྷ་མོ་ཤིང་ཐམས་ཅད་ཀྱི་མེ་ཏོག་རྒྱས་པས་བདེ་བར་གནས་པའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Go to her and ask her, ‘How should a bodhisattva ripen beings for the highest, complete enlightenment? How should a bodhisattva purify all buddha realms? How should a bodhisattva honor and serve all tathāgatas so as to please them? How should a bodhisattva be dedicated to the Dharma of all the buddhas?’

source: མཚན་མོའི་ལྷ་མོ་ཤིང་ཐམས་ཅད་ཀྱི་མེ་ཏོག་རྒྱས་པས་བདེ་བར་གནས་པ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བར་བྱས་ནས་ཡང་དང་ཡང་བལྟས་ཏེ། མཚན་མོའི་ལྷ་མོ་ཤིང་ཐམས་ཅད་ཀྱི་མེ་ཏོག་རྒྱས་པས་བདེ་བར་གནས་པའི་དྲུང་ནས་སོང་ངོ་།
en: Sudhana, the head merchant’s son, bowed his head to the feet of the night goddess Sarva­vṛkṣpraphullana­sukha­saṃvāsā, circumambulated the night goddess Sarva­vṛkṣpraphullana­sukha­saṃvāsā many hundreds of thousands of times, keeping her to his right, and, looking back again and again, departed from the night goddess Sarva­vṛkṣpraphullana­sukha­saṃvāsā.

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་མཚན་མོའི་ལྷ་མོ་འགྲོ་བ་ཐམས་ཅད་བསྲུང་བའི་སྨོན་ལམ་ལ་བརྩོན་པའི་འོད་གང་ན་བ་དེར་སོང་སོང་ནས།
en: Sarva­jagad­rakṣā­praṇidhāna­vīrya­prabhā Sudhana, the head merchant’s son, went to where the night goddess Sarva­jagad­rakṣā­praṇidhāna­vīrya­prabhā was.

source: མཚན་མོའི་ལྷ་མོ་འགྲོ་བ་ཐམས་ཅད་བསྲུང་བའི་སྨོན་ལམ་ལ་བརྩོན་པའི་འོད་འཁོར་གྱི་དཀྱིལ་འཁོར་གྱི་དཀྱིལ་འཁོར་དེ་ཉིད་ན།
en: He saw the night goddess Sarva­jagad­rakṣā­praṇidhāna­vīrya­prabhā in the center of her entourage, seated upon a throne that contained kings of jewels that illuminated the dwellings of all beings.

source: ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་རབ་ཏུ་སྣང་བའི་རིན་པོ་ཆེའི་དྲ་བས་ཀུན་ནས་ཡོག་པའི་ལུས་དང་ལྡན་པ།
en: She had a body covered completely in a net of jewels that illuminated the ways of the realm of phenomena.

source: གཉི་ཟླ་དང་གཟའ་སྐར་དང་། རྒྱུ་སྐར་ཐམས་ཅད་ཀྱི་གཟུགས་བརྙན་ཡོངས་སུ་སྟོན་པའི་ལུས་དང་ལྡན་པ།
en: Her body revealed the images of the sun, the moon, and all the planets, stars, and constellations.

source: བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཅན་གྱིས་རྣམ་པར་དམྱིགས་པར་སྟོན་པའི་ལུས་དང་ལྡན་པ།
en: She had a body that manifested to the perception of beings in accordance with their wishes.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་ཀྱི་དབྱིབས་དང་འདྲ་བར་རང་གི་ལུས་རྣམ་པར་དམྱིགས་པར་བྱེད་པའི་ལུས་དང་ལྡན་པ།
en: She had a body such that her own body was perceived by all beings as having the same form as their bodies.

source: ཁ་དོག་རྒྱ་མཚོ་ཡངས་པ་མཐའ་དང་དབུས་མྱེད་པ་རྣམ་པར་དམྱིགས་པར་སྟོན་པའི་ལུས་དང་ལྡན་པ་སྤྱོད་ལམ་ཐམས་ཅད་ལ་རྣམ་པར་སྤྱོད་པའི་ཚུལ་ཡོངས་སུ་སྟོན་པའི་ལུས་དང་ལྡན་པ།
en: She had a body that manifested perceptions of a vast, centerless, edgeless ocean of skin colors. She had a body that manifested practicing all paths of the practice of conduct.

source: སྒོ་ཀུན་ཏུ་མངོན་པར་བལྟས་པར་རྣམ་པར་དམིགས་པར་བྱེད་པའི་ལུས་དང་ལྡན་པ། ཆོས་ཀྱི་སྤྲིན་གྱི་འབྲུག་སྒྲ་ཀུན་ཏུ་སྒྲོག་ཅིང་རྣམ་པར་འཕྲུལ་པ་སྣ་ཚོགས་ཀྱི་ཕྱོགས་ཐམས་ཅད་རྒྱས་པར་བཀང་སྟེ། འགྲོ་བ་ཐམས་ཅད་ལ་མངོན་དུ་གནས་པའི་ལུས་དང་ལྡན་པ།
en: She had a body that could be perceived from every kind of orientation. She had a body that was present in all worlds, filling all directions with the sound of thunder from the cloud of the Dharma and with various miraculous manifestations.

source: དུས་ཐམས་ཅད་དུ་འགྲོ་བ་ཐམས་ཅད་ཀྱི་དོན་ལ་མངོན་དུ་བལྟས་པར་ནམ་མཁའི་དབྱིངས་ཀྱིས་ཀློ་བའི་ལུས་དང་ལྡན་པ།
en: She had a body that reached throughout the realm of space, at all times looking at how to benefit all beings.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཞབས་ལ་འདུད་ཅིང་ཕྱག་འཚལ་བའི་ལུས་དང་ལྡན་པ།
en: She had a body that paid homage and bowed down at the feet of all tathāgatas.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་བསྩགས་པ་ལ་གཅེས་ཤིང་སྔོན་དུ་འགྲོ་བའི་ལུས་དང་ལྡན་པ།
en: She had a body that came before all beings, aiding them in the accumulation of roots of merit.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལས་མངོན་དུ་ཆོས་ཀྱི་སྤྲིན་ཡང་དག་པར་ལེན་ཅིང་ཡོངས་སུ་འཛིན་པའི་སྨོན་ལམ་གྲུབ་ཅིང་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་སེམས་ལས་ཕྱིར་ཕྱོགས་སུ་མ་གྱུར་ཅིང་།
en: She had a body that possessed the mindfulness of keeping and never deviating from the motivation to accomplish and fulfill the prayer to receive and possess clouds of Dharma directly from all the tathāgatas.

source: དྲན་པས་ཡོངས་སུ་འཛིན་པའི་ལུས་དང་ལྡན་པ་མཐའ་དང་དབུས་མེད་པའི་འོད་ཀྱིས་ཕྱོགས་དང་ཕྱོགས་མཚམས་ཐམས་ཅད་རྒྱས་པར་འགེངས་བའི་ལུས་དང་ལྡན་པ།
en: She had a body that filled all principal and intermediate directions with light that had no edge or center.

source: འགྲོ་བ་ཐམས་ཅད་ཀྱི་མུན་པ་རྣམ་པར་སེལ་བའི་ཆོས་ཀྱི་སྒྲོན་མའི་འོད་ཀུན་ཏུ་འགྱེད་ཅིང་། སྣང་བ་ཡོངས་སུ་སྟོན་པའི་ལུས་དང་ལྡན་པ།
en: She had a body that manifested the illumination and the spreading light of the lamp of Dharma, dispelling the darkness in all beings.

source: ཆོས་སྒྱུ་མའི་རྣམ་པ་ལྟ་བུའི་ཡེ་ཤེས་ཀྱི་ལུས་དྲི་མ་མྱེད་པ་རབ་ཏུ་སྟོན་པའི་ལུས་དང་ལྡན་པ།
en: She had a body that manifested as a stainless body of the wisdom that phenomena are like illusions.

source: ཆོས་ཀྱི་ལུས་མུན་པ་དང་རྡུལ་དུ་བྲལ་བ་རབ་ཏུ་སྟོན་པའི་ལུས་དང་ལྡན་པ།
en: She had a body that manifested as a Dharma body free of darkness and dust.

source: ཆོས་ཉིད་སྒྱུ་མ་ལྟ་བུ་ལས་བྱུང་བའི་ལུས་དང་ལྡན་པ།
en: She had a body that appeared with the nature of being an illusion.

source: ཆོས་ཉིད་རབ་ཏུ་རྟོགས་པས་མུན་པ་མེད་པའི་སེམས་དང་ལྡན་པར་ཡེ་ཤེས་ཀྱི་སྣང་བ་སྒོ་ཀུན་ཏུ་གསལ་བ་རབ་ཏུ་ཐོབ་པ།
en: She had a mind free of darkness that had realized the true nature. She had attained the illumination in all aspects of the light of wisdom.

source: ཤིན་ཏུ་ནད་མེད་ཅིང་གདུང་བ་མེད་པའི་ཡིད་ཀྱི་ལུས་དང་ལྡན་པ།
en: She had a mental body that was completely free of illness and had no pain.

source: ཆོས་ཀྱི་སྐུ་མི་ཤིགས་ཤིང་བརྟན་པ་དང་ལྡན་པའི་དབྱིངས་ལས་བྱུང་བ།
en: She had appeared from the realm of the enduring and indestructible Dharma body.

source: དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་གནས་མེད་པའི་རང་བཞིན་ཀུན་ནས་ཉོན་མོངས་པ་མྱེད་པའི་ངང་དྲི་མ་མྱེད་པའི་ཆོས་ཉིད་ཀྱི་ལུས་རྣམ་པར་དག་པའི་ལུས་དང་ལྡན་པ་དེ་རིན་པོ་ཆེའི་རྒྱལ་པོ་འགྲོ་བ་ཐམས་ཅད་ཀྱི་གནས་རབ་ཏུ་སྣང་བའི་སྙིང་པོ་ཅན་གྱི་སྟན་ལ་འདུག་པ་མཐོང་ངོ་།
en: She had a body that was the pure body of the stainless true nature, the state completely without kleśas, and which had the nature of the unlocated blessing of the tathāgatas.

source: དེས་དེ་མཐོང་ནས་སྤྱི་བོས་བཏུད་དེ་མཐོང་བར་བྱ་བའི་ཚུལ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་རྗེས་སུ་དྲན་པར་བྱས་ནས་སའི་གཞི་ལས་བཏུད་དེ་རྒྱངས་བཅད་པ་ཞིག་ཏུ་མངོན་པར་བཏུད་དོ། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་སའི་གཞི་དེ་ལས་ལངས་ཏེ་ཐལ་མོ་སྦྱར་ནས། མཚན་མོའི་ལྷ་མོ་འགྲོ་བ་ཐམས་ཅད་བསྲུང་བའི་སྨོན་ལམ་ལ་བརྩོན་པའི་འོད་དེའི་ལུས་ལ་བལྟས་པ་དང་། འདུ་ཤེས་རྣམ་པར་དག་པ་བཅུ་ཐོབ་པར་གྱུར་ཏེ། དེ་དག་ཐོབ་པས་དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་དང་སྐལ་བ་མཉམ་པར་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ།
en: When he had seen her, he bowed his head, and, remembering the ways of seeing her, which were as numerous as the atoms in a buddha realm, he bowed down to the ground, prostrating himself for a long time. Sudhana, the head merchant’s son, then stood up from the ground, placed his palms together, and, looking at the body of the night goddess Sarva­jagad­rakṣā­praṇidhāna­vīrya­prabhā, he gained ten pure perceptions, and through gaining them he gained commonality with all kalyāṇamitras.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་བརྩམས་པའི་བརྩོན་འགྲུས་ལ་དམྱིགས་པ་ཐམས་ཅད་དུ་གནས་པར་བྱ་བའི་ཕྱིར། དགེ་བའི་བཤེས་གཉེན་རྣམས་ལ་རང་གི་སེམས་ཀྱི་འདུ་ཤེས་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ།
en: He gained the perception of his own mind being among the kalyāṇamitras in order to have all the diligence for undertaking the attainment of omniscience.

source: །དགེ་བའི་བཤེས་གཉེན་བསྙེན་བཀུར་ཞིང་དགེ་བའི་རྩ་བ་ཡངས་པ་ཡོངས་སུ་བསྒྲུབ་པ་གྲུབ་པར་བྱ་བའི་ཕྱིར། རང་གི་ལས་རྣམ་པར་སྨྱིན་པ་རྣམ་པར་དག་པའི་རང་བཞིན་གྱི་འདུ་ཤེས་རབ་ཏུ་ཐོབ་པོ།
en: He gained the perception of the pure nature of the ripening of his own karma so as to attain the accomplishment of vast roots of merit from honoring kalyāṇamitras.

source: །སྨོན་ལམ་ཐམས་ཅད་ཀྱིས་བརྒྱན་པའི་སྤྱོད་པ་ལ་ཡང་དག་པར་གནས་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་རྒྱན་གྱི་འདུ་ཤེས་རབ་ཏུ་ཐོབ་པོ།
en: He gained the perception of the adornment of bodhisattva conduct so as to remain in the conduct that is the adornment of all prayers.

source: །དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་ཀྱི་གདམས་ངག་གི་ལམ་ལ་ནན་ཏན་དུ་བྱ་བའི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་རབ་ཏུ་བསྒྲུབ་པའི་འདུ་ཤེས་རབ་ཏུ་ཐོབ་པོ།
en: He gained the perception of the accomplishment of all the Dharmas of the buddhas so as to practice the path of the instructions of all the tathāgatas.

source: །སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡུལ་དུ་གྱུར་བའི་ཆོས་བླ་ན་མེད་པ་ལ་རྣམ་པར་སྤྱོད་པའི་སྣང་བ་ཡོངས་སུ་མཐོང་བར་བྱ་བའི་ཕྱིར་ཉམས་སུ་མྱོང་བ་བསྐྱེད་པའི་འདུ་ཤེས་རབ་ཏུ་ཐོབ་བོ།
en: He gained the perception of the arising of sensations so as to see the radiance of practicing the unsurpassable Dharma that is the field of all buddhas.

source: །ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པས་འབྱུང་བའི་སྨོན་ལམ་དང་། སྤྱོད་པ་རྣམ་པར་དག་པར་བྱ་བའི་ཕྱིར་འབྱུང་བ་གཅིག་གི་འདུ་ཤེས་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །དགེ་བའི་ཆོས་ཡོངས་སུ་བསྩགས་པ་ཐམས་ཅད་རྣམ་པར་འཕེལ་བར་བྱ་བའི་ཕྱིར་ཐམས་ཅད་མཁྱེན་པའི་བསོད་ནམས་རྒྱ་མཚོའི་འབྱུང་གནས་ཀྱི་འདུ་ཤེས་རབ་ཏུ་ཐོབ་བོ།
en: He gained the perception of a single setting forth so as to have the pure conduct and prayer of setting forth through the completely good conduct. (7) He gained the perception of the origin of the ocean of the merit of omniscience so as to increase the accumulation of all good qualities.

source: །སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཏུ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་བརྩོན་འགྲུས་ཀྱི་ཤུགས་ཡོངས་སུ་འཕེལ་བར་བྱ་བའི་ཕྱིར། དགེ་བའི་ཆོས་ཡོངས་སུ་མ་རྫོགས་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་དང་། ཡང་དག་པར་འཕེལ་བར་བྱེད་པ་དང་། ཡོངས་སུ་སྐྱོང་བའི་འདུ་ཤེས་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ།
en: He gained the perception of protecting, increasing, and completing incomplete good qualities so as to increase the power of diligence for omniscience in the enlightenment of buddhahood.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཐམས་ཅད་ཡོངས་རྫོགས་པར་བྱ་བའི་ཕྱིར། དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པའི་འདུ་ཤེས་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ།
en: He gained the perception of the completion of all roots of merit so as to fulfill the wishes of all beings.

source: །བྱང་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ཆོས་ལ་དབང་བསྒྱུར་བ་རབ་ཏུ་གནས་པར་བྱ་བའི་ཕྱིར་དགེ་བའི་བཤེས་གཉེན་རྣམས་ལ་དོན་ཐམས་ཅད་ཡོངས་སུ་སྒྲུབ་པའི་འདུ་ཤེས་རབ་ཏུ་ཐོབ་སྟེ།
en: He gained the perception of the accomplishment of all goals among kalyāṇamitras so as to be established in having the power of the qualities of all bodhisattvas.

source: འདུ་ཤེས་རྣམ་པར་དག་པ་བཅུ་པོ་དེ་དག་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ།
en: Those are the ten pure perceptions he gained.

source: །དེ་དག་ཐོབ་པས་མཚན་མོའི་ལྷ་མོ་འགྲོ་བ་ཐམས་ཅད་བསྲུང་བའི་སྨོན་ལམ་ལ་བརྩོན་པའི་འོད་སྣང་བ་ལས་བྱང་ཆུབ་སེམས་དཔའ་དང་། བསྐལ་པ་མཐུན་པ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཐོབ་པར་གྱུར་ཏེ།
en: Having gained them, he gained from the night goddess Sarva­jagad­rakṣā­praṇidhāna­vīrya­prabhā commonalities with bodhisattvas that were as numerous as the atoms in a buddha realm. These were the commonality of memory in the way of remembering the three times of all the tathāgatas in the ten directions; the commonality of understanding in comprehending the different ways of the ocean of all Dharmas;

source: འདི་ལྟར་ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དུས་གསུམ་རྗེས་སུ་དྲན་པའི་ཚུལ་ལ་དྲན་པའི་སྐལ་བ་མཉམ་པ་དང་། ཆོས་རྒྱ་མཚོའི་ཚུལ་ཐམས་ཅད་ཐ་མྱི་དད་པར་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་བློ་གྲོས་ཀྱི་སྐལ་པ་མཉམ་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོའི་དཀྱིལ་འཁོར་རིག་པས་རྗེས་སུ་ཤེས་པར་བྱ་བའི་བྱེ་བྲག་དང་། ཚུལ་ཐ་དད་པར་མཁས་པ་ལ་རེག་པའི་སྐལ་བ་མཉམ་པ་དང་། བློ་ནམ་མཁའ་དང་མཉམ་པས་དུས་གསུམ་ཐམས་ཅད་ཀྱི་ཚུལ་རྒྱ་མཚོ་སྣང་བ་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཕྱིར་བློའི་སྐལ་བ་མཉམ་པ་དང་། བྱང་ཆུབ་སེམས་དེའི་ཐམས་ཅད་ཀྱི་དབང་པོ་རྒྱ་མཚོ་ཤེས་པའི་སྣང་བ་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཕྱིར་དབང་པོ་རྣམ་པར་དག་པའི་སྐལ་བ་མཉམ་པ་དང་། རྣམ་པ་ཐམས་ཅད་དུ་སེམས་ཅན་ཡོངས་སུ་བསྡུ་བའི་རྒྱན་གྱིས་རྣམ་པར་བརྒྱན་པའི་བྱང་ཆུབ་སེམས་དཔའི་ལམ་གྱི་ཡོན་ཏན་ལ་ནན་ཏན་དུ་བྱ་བའི་རྒྱན་གྱི་ལམ་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་སེམས་རྣམ་པར་དག་པའི་སྐལ་བ་མཉམ་པ་དང་། དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱི་སྤྱོད་ཡུལ་སྣང་བར་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཕྱིར་སྤྱོད་ཡུལ་གྱི་སྐལ་བ་མཉམ་པ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཚུལ་རྒྱ་མཚོ་ལ་འཇུག་པའི་ལམ་སྣང་བ།
en: the commonality of knowledge in the skill of the different, particular ways of having knowledge of the range of the wheel of the Dharma of all the tathāgatas; the commonality of understanding for attaining, through an understanding as extensive as space, the illumination of the ocean of ways in the three times; the commonality of pure faculties for attaining the illumination of the knowledge of an ocean of the faculties of all bodhisattvas; the commonality of pure mind for realizing the path adorned by the acquisition of the qualities of the bodhisattva path with its display of gathering beings in every way; the commonality of a pure field of activity for attaining the illumination of the field of activity of the wisdom of the tathāgatas;
